In [1]:
import mysql.connector as sql
from pandas import read_sql_query

con = sql.connect(host='localhost', user='root', password='mysql@dev', database='joins')
print(con)

def query(q):
    return read_sql_query(q, con)

<mysql.connector.connection.MySQLConnection object at 0x00000133BD327E48>

In [ ]:
c = con.cursor()

In [ ]:
c.execute("SHOW TABLES;")
c.fetchall()

### Creating tables

In [ ]:
# c.execute("CREATE TABLE t1 (c1 INT, c2 CHAR(1), c3 CHAR(1));")

In [ ]:
c.execute("SHOW TABLES;")
c.fetchall()

In [ ]:
c.execute("DESCRIBE t1")
c.fetchall()

In [2]:
query("DESCRIBE t1")

  Field        Type Null Key Default Extra
0    c1      b'int'  YES        None
1    c2  b'char(1)'  YES        None
2    c3  b'char(1)'  YES        None

In [ ]:
# c.execute("CREATE TABLE t2 ( c4 INT, c5 INT, c6 INT );")

In [3]:
query("DESCRIBE t2")

  Field    Type Null Key Default Extra
0    c4  b'int'  YES        None
1    c5  b'int'  YES        None
2    c6  b'int'  YES        None

### Inserting Data

In [ ]:
c.execute("""INSERT INTO t1 (c1, c2, c3)
                     VALUES (1, 'a', 'b'),
                            (2, 'c', 'd'),
                            (4, 'e', 'f'),
                            (5, 'g', 'h');""")

In [ ]:
c.execute("""INSERT INTO t2 (c4, c5, c6)
                     VALUES (1,  0,  1),
                            (2,  1,  0),
                            (3,  0,  1),
                            (5,  1,  0);""")

In [ ]:
c.execute("COMMIT")

In [4]:
query("SELECT * FROM t1")

   c1 c2 c3
0   1  a  b
1   2  c  d
2   4  e  f
3   5  g  h

In [5]:
query("SELECT * FROM t2")

   c4  c5  c6
0   1   0   1
1   2   1   0
2   3   0   1
3   5   1   0

# Inner Join

In [6]:
query("SELECT * FROM t1 JOIN t2 ON t1.c1=t2.c4;")

   c1 c2 c3  c4  c5  c6
0   1  a  b   1   0   1
1   2  c  d   2   1   0
2   5  g  h   5   1   0

# LEFT outer join/ LEFT JOIN

In [7]:
query("SELECT * FROM t1 LEFT JOIN t2 ON t1.c1=t2.c4;")

   c1 c2 c3   c4   c5   c6
0   1  a  b  1.0  0.0  1.0
1   2  c  d  2.0  1.0  0.0
2   4  e  f  NaN  NaN  NaN
3   5  g  h  5.0  1.0  0.0

# RIGHT Join

In [8]:
query("SELECT * FROM t1 RIGHT JOIN t2 ON t1.c1=t2.c4;")

    c1    c2    c3  c4  c5  c6
0  1.0     a     b   1   0   1
1  2.0     c     d   2   1   0
2  NaN  None  None   3   0   1
3  5.0     g     h   5   1   0

# FULL Join

In [10]:
query("""SELECT * FROM t1 LEFT JOIN t2 ON t1.c1=t2.c4
         UNION ALL
         SELECT * FROM t1 RIGHT JOIN t2 ON t1.c1=t2.c4;""")

    c1    c2    c3   c4   c5   c6
0  1.0     a     b  1.0  0.0  1.0
1  2.0     c     d  2.0  1.0  0.0
2  4.0     e     f  NaN  NaN  NaN
3  5.0     g     h  5.0  1.0  0.0
4  1.0     a     b  1.0  0.0  1.0
5  2.0     c     d  2.0  1.0  0.0
6  NaN  None  None  3.0  0.0  1.0
7  5.0     g     h  5.0  1.0  0.0

In [11]:
query("SELECT * FROM t1")

   c1 c2 c3
0   1  a  b
1   2  c  d
2   4  e  f
3   5  g  h

In [12]:
query("SELECT * FROM t2")

   c4  c5  c6
0   1   0   1
1   2   1   0
2   3   0   1
3   5   1   0

# Join three tables.

In [ ]:
query("")